system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

    vertices
 (
    (-3.5 -3.0 -0.5)
    ( 3.5 -3.0 -0.5)
    ( 3.5  3.0 -0.5)
    (-3.5  3.0 -0.5)
    (-3.5 -3.0  3.5)
    ( 3.5 -3.0  3.5)
    ( 3.5  3.0  3.5)
    (-3.5  3.0  3.5)
 );

   blocks
  (
    hex (0 1 2 3 4 5 6 7) (70 60 40) simpleGrading (1 1 1)
 );
edges
(
);

boundary
(
    // در snappyHexMesh کل این جعبه بیرونی است و اهمیت مرزی ندارد
    outerBox
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
