system/fvOptions
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}

limitT
{
    type            limitTemperature;
    active          true;
    selectionMode   all;
    min             250; // حدود -23 درجه سانتی گراد
    max             350; // حدود 77 درجه سانتی گراد
}
